
text = "Мова програмування - це інструмент для творення програм. Вона визначає набір правил, за якими можна створювати програми для вирішення різноманітних задач.\
Програмування вимагає логічного мислення та креативності.\
У процесі написання коду розробники вирішують завдання та створюють нові можливості для комп'ютерів та програм."

# Програмний код для обробки тексту
# split(): Розділяє рядок на список слів, використовуючи пробіли за замовчуванням.
words = text.split()
print("Слова в тексті:", words)

# Підрахунок кількості слів
# len(): Повертає кількість елементів у списку, тобто кількість слів у тексті.
word_count = len(words)
print("Кількість слів у тексті:", word_count)

# Заміна слова у тексті
# replace(): Заміняє вказане слово іншим у тексті.
text_modified = text.replace("програмування", "Python")
print("Змінений текст:", text_modified)

